app/controllers/products_controller.rb

    def index
        authenticated = UserAuthenticated.last
        if authenticated.id_user_authenticated.nil?
            redirect_to "/", notice: "Usuário sem permissão."
        else
            user = User.find(authenticated.id_user_authenticated)
            if !user.admin
                redirect_to "/", notice: "Usuário sem permissão."
            else
                @products = Product.all
---
SELECT `user_authenticateds`.* FROM `user_authenticateds` ORDER BY `user_authenticateds`.`id` DESC LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 51 LIMIT 1
SELECT `products`.* FROM `products`

    def create
        id_admin = params[:id_admin]
        product_name = params[:name]
        product_value = params[:value]

        Product.create(name: product_name,value: product_value)
---
INSERT INTO `products` (`name`, `value`, `created_at`, `updated_at`) VALUES ('Jaca', 1.56, '2022-12-22 20:53:36.941850', '2022-12-22 20:53:36.941850')