app/controllers/shopping_list_controller.rb

SELECT `shopping_lists`.* FROM `shopping_lists` WHERE `shopping_lists`.`id` = 4 LIMIT 1
DELETE FROM `shopping_lists` WHERE `shopping_lists`.`id` = 4
DELETE FROM `list_products` WHERE `list_products`.`id` = 8
---
    def destroy
        id_list = params[:id]
        list = ShoppingList.find_by(id: id_list)
        if list.nil?
            redirect_to "/user/#{list.user_id}/shopping_list", notice: "Lista não cadastrada."
            #render json: {"Mensagem": "Lista não cadastrada"}
        else
            ShoppingList.destroy_by(id: id_list)
            ListProduct.destroy_by(shopping_list_id: id_list)