app/controllers/shopping_list_controller.rb

    def new
        @products = Product.all
        user = UserAuthenticated.last
        id_user = user.id_user_authenticated
        @user = User.find(id_user)
---
SELECT `products`.* FROM `products`
SELECT `user_authenticateds`.* FROM `user_authenticateds` ORDER BY `user_authenticateds`.`id` DESC LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 7 LIMIT 1

    def create
        user = UserAuthenticated.last
        id_user = user.id_user_authenticated
        id_list = params[:id_list]
        #SEPARAR O ID DOS PRODUTOS QUE VEM POR PARAMS
        i = 0
        j = 0
        params_field = []
        params_value = []
        params.each do |field, value|
            if (i>0) and (field != "controller") and (field != "action")
                params_value[j] = value
                j = j + 1
            end
            i = i + 1
        end

        #VERIFICA SE JA EXISTI ALGUMA LISTA CADASTRADA COM O VALOR DO ID_LIST
        check_list = ShoppingList.find_by(id: id_list)

        if j == 0
            redirect_to "/shopping_list/new", notice: "Nenhum produto selecionado."
        elsif id_list == ""
            redirect_to "/shopping_list/new", notice: "Preencha o campo 'Número da lista:'."
        elsif id_user == ""
            redirect_to "/shopping_list/new", notice: "Preencha o campo 'ID usuário:'."
        elsif !check_list.nil?
            redirect_to "/shopping_list/new", notice: "O número da lista ja está sendo utilizado."
        else
            ShoppingList.create(id: id_list,user_id: id_user)
            params_value.each do |row|
                ListProduct.create(shopping_list_id: id_list,product_id: row)
---
SELECT `user_authenticateds`.* FROM `user_authenticateds` ORDER BY `user_authenticateds`.`id` DESC LIMIT 1
SELECT `shopping_lists`.* FROM `shopping_lists` WHERE `shopping_lists`.`id` = NULL LIMIT 1
INSERT INTO `shopping_lists` (`id`, `user_id`, `created_at`, `updated_at`) VALUES (889, 35, '2022-12-14 18:04:43.635381', '2022-12-14 18:04:43.635381')
INSERT INTO `list_products` (`shopping_list_id`, `product_id`, `created_at`, `updated_at`) VALUES (889, 5, '2022-12-14 18:04:43.726645', '2022-12-14 18:04:43.726645')

    def destroy
        id_list = params[:id]
        list = ShoppingList.find_by(id: id_list)
        if list.nil?
            redirect_to "/user/#{list.user_id}/shopping_list", notice: "Lista não cadastrada."
        else
            ShoppingList.destroy_by(id: id_list)
            ListProduct.destroy_by(shopping_list_id: id_list)
---
SELECT `shopping_lists`.* FROM `shopping_lists` WHERE `shopping_lists`.`id` = 27 LIMIT 1
DELETE FROM `shopping_lists` WHERE `shopping_lists`.`id` = 27
DELETE FROM `list_products` WHERE `list_products`.`id` = 29