app/controllers/user_controller.rb

INSERT INTO `users` (`first_name`, `last_name`, `age`, `password`, `admin`, `created_at`, `updated_at`) VALUES ('Lucas', 'Conrado', 27, '753', TRUE, '2022-12-12 20:59:56.489810', '2022-12-12 20:59:56.489810')
---
    def create
        user_fisrt_name = params[:first_name]
        user_last_name = params[:last_name]
        user_age = params[:age]
        user_password = params[:password]

        user = User.create(first_name: user_fisrt_name,last_name: user_last_name,age: user_age,password: user_password,admin: false)

SELECT `users`.* FROM `users` WHERE `users`.`id` = 6 LIMIT 1
---
    def show
        id_user = params[:id]
        @user = User.find_by(id: id_user)

SELECT `users`.* FROM `users` WHERE (35) LIMIT 1
---
    def edit
        @user = User.find(params[:id])

UPDATE `users` SET `users`.`first_name` = 'Pedro', `users`.`password` = '123', `users`.`updated_at` = '2022-12-13 18:43:54.261470' WHERE `users`.`id` = 35
---
    def update
        user_fisrt_name = params[:first_name]
        user_last_name = params[:last_name]
        user_age = params[:age]
        user_password = params[:password]

        id_user = params[:id]
        user = User.find_by(id: id_user)
        user.first_name = user_fisrt_name
        user.last_name = user_last_name
        user.age = user_age
        user.password = user_password
        user.save

SELECT `shopping_lists`.* FROM `shopping_lists` WHERE `shopping_lists`.`user_id` = 3
DELETE FROM `shopping_lists` WHERE `shopping_lists`.`id` = 6
DELETE FROM `list_products` WHERE `list_products`.`id` = 13
DELETE FROM `users` WHERE `users`.`id` = 3
---
    def destroy
        id_admin = params[:id_admin]

        user_id = params[:id]
        user = User.find(user_id)
        lists = user.shopping_lists
        lists.each do |row|
            ShoppingList.destroy_by(id: row.id)
            ListProduct.destroy_by(shopping_list_id: row.id)
        end

        User.destroy_by(id: user_id)

SELECT `products`.* FROM `products` INNER JOIN `list_products` ON `products`.`id` = `list_products`.`product_id` WHERE `list_products`.`shopping_list_id` = 4
SELECT `shopping_lists`.* FROM `shopping_lists` WHERE `shopping_lists`.`user_id` = 1
---
    def shopping_list
        @user = User.find_by(id: params[:id])
        if @user.nil?
            render json: {"Mensagem": "Usuário não cadastrado"}
        else
            @n_list = @user.shopping_lists

            if @n_list.nil?
                redirect_to "/user/#{@user.id}", notice: "Usuário não possui lista cadastrada."
                #render json: {"Mensagem": "Usuário não possui lista cadastrada"}
            else
                @shopping_list = @n_list.map { |row| row.products }

SELECT `users`.* FROM `users` WHERE `users`.`first_name` = 'Pedro' LIMIT 1
---
    def login
        first_name = params[:first_name]
        password = params[:password]
        user = User.find_by(first_name: first_name)