app/controllers/user_controller.rb

    def index
        @id_admin = params[:id_admin]
        if @id_admin.nil?
            redirect_to "/", notice: "Usuário sem permissão otario."
        else
            @users = User.all
---
SELECT `users`.* FROM `users`

    def create
        user_fisrt_name = params[:first_name]
        user_last_name = params[:last_name]
        user_age = params[:age]
        user_password = params[:password]
        user_name = User.find_by(first_name: user_fisrt_name)

        if !user_name.nil?
            redirect_to "/user/new", notice: "Usuário já cadastrado."
        elsif user_fisrt_name == ""
            redirect_to "/user/new", notice: "Preencha o campo 'Primeiro Nome:'."
        elsif user_last_name == ""
            redirect_to "/user/new", notice: "Preencha o campo 'Segundo Nome:'."
        elsif user_age == ""
            redirect_to "/user/new", notice: "Preencha o campo 'Idade:'."
        elsif user_password == ""
            redirect_to "/user/new", notice: "Digite uma senha."
        else
            user = User.create(first_name: user_fisrt_name,last_name: user_last_name,age: user_age,password: user_password,admin: false)
---
SELECT `users`.* FROM `users` WHERE `users`.`first_name` = 'Zeca' LIMIT 1
INSERT INTO `users` (`first_name`, `last_name`, `age`, `password`, `admin`, `created_at`, `updated_at`) VALUES ('Zeca', 'Tamagro', 123, '456', FALSE, '2022-12-14 18:15:33.747587', '2022-12-14 18:15:33.747587')

    def show
        id_user = params[:id]
        id_authenticated = id_user.to_i
        authenticated = UserAuthenticated.last
        if authenticated.id_user_authenticated != id_authenticated
            redirect_to "/", notice: "Usuário sem permissão."
        else
            @user = User.find_by(id: id_user)
---
SELECT `user_authenticateds`.* FROM `user_authenticateds` ORDER BY `user_authenticateds`.`id` DESC LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 35 LIMIT 1

    def edit
        @user = User.find(params[:id])
        authenticated = UserAuthenticated.last
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `user_authenticateds`.* FROM `user_authenticateds` ORDER BY `user_authenticateds`.`id` DESC LIMIT 1

    def update
        user_fisrt_name = params[:first_name]
        user_last_name = params[:last_name]
        user_age = params[:age]
        user_password = params[:password]
        id_user = params[:id]
        user_name = User.find_by(first_name: user_fisrt_name)

        if !user_name.nil?
            redirect_to "/user/#{id_user}/edit", notice: "Usuário já cadastrado."
        elsif user_fisrt_name == ""
            redirect_to "/user/#{id_user}/edit", notice: "Preencha o campo 'Primeiro Nome:'."
        elsif user_last_name == ""
            redirect_to "/user/#{id_user}/edit", notice: "Preencha o campo 'Segundo Nome:'."
        elsif user_age == ""
            redirect_to "/user/#{id_user}/edit", notice: "Preencha o campo 'Idade:'."
        elsif user_password == ""
            redirect_to "/user/#{id_user}/edit", notice: "Digite uma senha."
        else
            user = User.find_by(id: id_user)
            user.first_name = user_fisrt_name
            user.last_name = user_last_name
            user.age = user_age
            user.password = user_password
            user.save
---
SELECT `users`.* FROM `users` WHERE `users`.`first_name` IS NULL LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 50 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
UPDATE `users` SET `users`.`first_name` = NULL, `users`.`last_name` = NULL, `users`.`age` = NULL, `users`.`password` = NULL, `users`.`updated_at` = '2022-12-22 19:18:07.968606' WHERE `users`.`id` = 50

    def destroy
        authenticated = UserAuthenticated.last
        id_admin = authenticated.id_user_authenticated

        user_id = params[:id]
        user = User.find(user_id)
        lists = user.shopping_lists
        lists.each do |row|
            ShoppingList.destroy_by(id: row.id)
            ListProduct.destroy_by(shopping_list_id: row.id)
        end

        User.destroy_by(id: user_id)
---
SELECT `user_authenticateds`.* FROM `user_authenticateds` ORDER BY `user_authenticateds`.`id` DESC LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 49 LIMIT 1
SELECT `shopping_lists`.* FROM `shopping_lists` WHERE `shopping_lists`.`user_id` = 49
DELETE FROM `shopping_lists` WHERE `shopping_lists`.`id` = 11
DELETE FROM `list_products` WHERE `list_products`.`id` = 60
DELETE FROM `shopping_lists` WHERE `shopping_lists`.`id` = 76
DELETE FROM `users` WHERE `users`.`id` = 49

    def shopping_list
        @user = User.find(params[:id])
        authenticated = UserAuthenticated.last
        if @user.id != authenticated.id_user_authenticated
            redirect_to "/", notice: "Usuário sem permissão."
        else
            if @user.nil?
                redirect_to "/", notice: "Usuário não cadastrado."
            else
                @n_list = @user.shopping_lists

                if @n_list.nil?
                    redirect_to "/user/#{@user.id}", notice: "Usuário não possui lista cadastrada."
                else
                    @shopping_list = @n_list.map { |row| row.products }
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
SELECT `user_authenticateds`.* FROM `user_authenticateds` ORDER BY `user_authenticateds`.`id` DESC LIMIT 1
SELECT `list_products`.* FROM `list_products` WHERE `list_products`.`shopping_list_id` = 1
SELECT `products`.* FROM `products` INNER JOIN `list_products` ON `products`.`id` = `list_products`.`product_id` WHERE `list_products`.`shopping_list_id` = 1
SELECT `shopping_lists`.* FROM `shopping_lists` WHERE `shopping_lists`.`user_id` = 2

    def login
        first_name = params[:first_name]
        password = params[:password]
        user = User.find_by(first_name: first_name)
        if user.nil?
            redirect_to "/", notice: "Usuário não cadastrado."
        elsif user.password != password
            redirect_to "/", notice: "Senha incorreta."
        else
            user_authenticated = UserAuthenticated.create(id_user_authenticated: user.id)
---
SELECT `users`.* FROM `users` WHERE `users`.`first_name` = 'Pedro' LIMIT 1
INSERT INTO `user_authenticateds` (`id_user_authenticated`, `created_at`, `updated_at`) VALUES (35, '2022-12-14 18:15:39.418657', '2022-12-14 18:15:39.418657')

    def logout
        user = UserAuthenticated.last
        user.id_user_authenticated = ""
        user.save
---
SELECT `user_authenticateds`.* FROM `user_authenticateds` ORDER BY `user_authenticateds`.`id` DESC LIMIT 1
INSERT INTO `user_authenticateds` (`id_user_authenticated`, `created_at`, `updated_at`) VALUES (52, '2022-12-27 16:43:45.653145', '2022-12-27 16:43:45.653145')
UPDATE `user_authenticateds` SET `user_authenticateds`.`id_user_authenticated` = NULL, `user_authenticateds`.`updated_at` = '2022-12-14 18:20:55.220845' WHERE `user_authenticateds`.`id` = 10