app/controllers/user_controller.rb

SELECT `user_authenticateds`.* FROM `user_authenticateds` ORDER BY `user_authenticateds`.`id` DESC LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 51 LIMIT 1
---
    def index
        authenticated = UserAuthenticated.last
        if authenticated.id_user_authenticated.nil?
            redirect_to "/", notice: "Usuário sem permissão."
        else
            user = User.find(authenticated.id_user_authenticated)